; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	image0 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star2 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation3 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star6)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star18)
)
(:goal (and
	(pointing satellite1 Star10)
	(have_image Planet7 image0)
	(have_image Phenomenon8 image0)
	(have_image Star9 image0)
	(have_image Star10 infrared1)
	(have_image Planet11 infrared1)
	(have_image Planet12 infrared1)
	(have_image Planet13 image0)
	(have_image Planet14 image0)
	(have_image Planet15 infrared1)
	(have_image Phenomenon16 image0)
	(have_image Phenomenon17 image0)
	(have_image Star18 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation3 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 13
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 13
3. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 13
4. (turn_to satellite1 planet12 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet12)
   goals met: 0 of 13
5. (take_image satellite1 planet12 instrument3 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 1 of 13
6. (turn_to satellite1 planet11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet11)
   goals met: 1 of 13
7. (take_image satellite1 planet11 instrument3 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 2 of 13
8. (turn_to satellite1 phenomenon8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 13
9. (take_image satellite1 phenomenon8 instrument3 image0)
   added: (have_image phenomenon8 image0)
   goals met: 3 of 13
10. (turn_to satellite1 phenomenon17 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon17)
   goals met: 3 of 13
11. (take_image satellite1 phenomenon17 instrument3 image0)
   added: (have_image phenomenon17 image0)
   goals met: 4 of 13
12. (turn_to satellite1 phenomenon16 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon16)
   goals met: 4 of 13
13. (take_image satellite1 phenomenon16 instrument3 image0)
   added: (have_image phenomenon16 image0)
   goals met: 5 of 13
14. (turn_to satellite1 planet13 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet13)
   goals met: 5 of 13
15. (take_image satellite1 planet13 instrument3 image0)
   added: (have_image planet13 image0)
   goals met: 6 of 13
16. (turn_to satellite1 planet14 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet14)
   goals met: 6 of 13
17. (take_image satellite1 planet14 instrument3 image0)
   added: (have_image planet14 image0)
   goals met: 7 of 13
18. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 7 of 13
19. (take_image satellite1 planet15 instrument3 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 8 of 13
20. (turn_to satellite1 planet7 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet7)
   goals met: 8 of 13
21. (take_image satellite1 planet7 instrument3 image0)
   added: (have_image planet7 image0)
   goals met: 9 of 13
22. (turn_to satellite1 star18 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star18)
   goals met: 9 of 13
23. (take_image satellite1 star18 instrument3 infrared1)
   added: (have_image star18 infrared1)
   goals met: 10 of 13
24. (turn_to satellite1 star9 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star9)
   goals met: 10 of 13
25. (take_image satellite1 star9 instrument3 image0)
   added: (have_image star9 image0)
   goals met: 11 of 13
26. (turn_to satellite1 star10 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star10)
   goals met: 12 of 13
27. (take_image satellite1 star10 instrument3 infrared1)
   added: (have_image star10 infrared1)
   goals met: 13 of 13
